class Road:  # объявление класса

    def __init__(self, length, width):  # определение атрибутов класса при инициализации
        self._length = length
        self._width = width
        print("Для расчета массы асфальта, необходимого для покрытия все дороги воспользуйтесь методом calc_road"
              "с аргументами в виде массы асфальта на один кв метр и толщины полотна в см.")

    def calc_road(self, m_mass, thickness):  # формула подсчета нужной массы асфальта
        result = f"{round(self._length * self._width * m_mass * thickness / 1000)} т"
        return result
        # честно говоря, не очень понял саму формулу, поэтому делю результат на 1000, чтобы получалось правильно


r = Road(2000, 20)  # создание экзэмпляра
print(r.calc_road(25, 5))  # проверка метода
